[
  {
    "title": "An Interview with United CEO Scott Kirby About Tech Transformation",
    "publication_date": "2026-01-15T06:00:00-05:00",
    "cleaned_text": "Listen to this post:\nYour browser does not support the audio element.\nGood morning,\nThis week’s Stratechery Interview is with\nUnited CEO Scott Kirby\n. Kirby has had a remarkable career in the aviation industry. He was one of the chief architects of the industry’s consolidation in the earlier part of this century, and, over the last decade, has transformed United Airlines into a consistently profitable and aggressively growing behemoth.\nThis might seem, at first glance, to be an odd interview subject for me. However, there are two interconnected angles undergirding my coverage. First, I have been a witness and personal beneficiary of Kirby’s changes; over the last decade the transformation in United’s product has been very tangible to me, and very much appreciated. Secondly, however, and more pertinent to Stratechery, is that it has been clear to me that United’s transformation has been driven first and foremost by an investment in technology. United first earned my loyalty by having by far the best website and app experience; that sort of loyalty is exactly what Kirby has been focused on, and it has in turn made it possible for United to improve many more aspects of the customer experience.\nIn this interview we cover all of that, including Kirby’s background, belief in differentiation, and how United’s improvements were made possible by rebuilding the company’s tech stack from the ground up. We also touch on the challenges of competing internationally, AI, Starlink, and my own personal wishlist for my most used airline.\nAs a reminder, all Stratechery content, including interviews, is available as a podcast; click the link at the top of this email to add Stratechery to your podcast player.\nOn to the Interview:\nAn Interview with United CEO Scott Kirby About Tech Transformation\nThis interview is lightly edited for clarity.\nTopics:\nBackground\n|\nDriving Consolidation\n|\nAirline Differentiation\n|\nUnited’s Tech Advantage\n|\nThe Customer Experience\n|\nCompeting Internationally\n|\nAI & Starlink\nBackground\nScott Kirby, welcome to Stratechery.\nScott Kirby:\nThanks for having me.\nThis is perhaps an odd venue for you given this is a site about technology, and you are an odd subject for me given you’re an airline executive, but this is actually an interview I’ve been looking forward to for a very long time for reasons that I think will become clear in our conversation. I am, however, like many of my readers, a bit of an aviation geek, and for what it’s worth, I’ve been a\nPremier 1K member\nfor many years.\nSK:\nThank you!\nYou’re welcome. So, I guess that’s my conflict of interest declaration.\nSK:\nIt’s a cool, sexy industry, even if it’s not technology.\nWell, it’s fun, because it’s so sexy from a product perspective and can be very not sexy from a financial perspective.\nSK:\nYeah, we’re trying to change that.\nI also have some very personalized feedback for you, but I’ll save that for the end. Before I get into United and the tech angle, I do want to explore, I always like to open these interviews by learning more about my subject, you, specifically. Where did you grow up? When did you get interested in airplanes? I saw that you went to the Air Force Academy, so it was clearly quite early.\nSK:\nYeah. I grew up in what at the time was a small town, Rowlett, Texas, not even big enough to have a high school, so I had to go to high school in a different city. But I early on decided I wanted to go to the Air Force Academy. I read a lot, and I had read history, World War II, and World War II was about airpower. So, I wanted to be a pilot, and then an astronaut. Went to the Air Force Academy, realized while there I was not going to be a fighter pilot, so I chose not to go to pilot training. Got my graduate degree in operations research, which is applied math, wanted to do something with math so just by accident wound up back in the airline industry, because I wanted to do something with math. But it’s been great ever since.\nWell, a somewhat related question, when did you learn to\ncount cards\n?\nSK:\nI used to play poker a lot, and when I got out of the Air Force Academy, I went down to Biloxi, Mississippi for four-and-a-half months, and I was going out on this international boat where you could play poker and it was just like shooting fish in a barrel. People were terrible, and I would make a bunch of money and a buddy of mine told me about, “Oh, you should count cards”.\nSo I got the green book — I forget the title of the author, but it’s called the Bible for Card Counters [\nBlackjack for Blood: The Card Counters’ Bible, and Complete Winning Guide\n]. I learned to count cards, I went to DC working at the Pentagon, I started going off to — it’s self-taught, but started going up to Atlantic City, and then, of course, went to Vegas a lot. If you’ve ever read or saw\nthe movie about the blackjack team\nthat was in Boston, two different times when I was in Vegas, somebody came and asked me if I wanted to join their team, because it’s obvious to tell if there’s another card counter.\nYeah.\nSK:\nBut, anyways, that was a long time ago. They’ve made it impossible now I think for card counters to be successful, but you could do pretty well back in the day.\nDriving Consolidation\nI’ll circle back to that, but you actually moved back to the airline industry with America West.\nSK:\nYeah, America West.\nSo you are a part of America West, a series of acquisitions that, ultimately, ends up at American Airlines. Tell me about that, that path, and how you rose through the ranks.\nSK:\nSure. I was at America West, the number two executive, I got appointed to be the Chief Commercial Officer on September 10th, 2001.\nAnd what level did you join at?\nSK:\nI joined as a Managing Director of Route Planning and Scheduling. It was a small airline — like 80 airplanes at the time I got there, based in Phoenix, Arizona. A guy named\nBill Franke\n, who is still around, owns a bunch of ultra low-cost carriers around the globe, I saw him last week when I was out in Phoenix, but was the CEO. Not an airline guy, he hired a bunch of us young kids.\nWhat I remember about the interview with Bill, at the time I was at American Airlines, at a subsidiary of American, it was doing well and I went to interview with Bill, and he said, “I’ve been told that you’re an up-and-coming star, and you’re going to go far at American. American is on top of the world, why would you possibly want to come to little America West?”, and I said, “Well, at American, they are doing well, they’re the best in the world, but if you want to change or try anything new, you have to prove beyond a shadow of a doubt that you won’t break anything and it won’t screw up, which is impossible, so you can’t change or try anything new”. And he said, “Well, everything at America West is effed up” — he didn’t say effed — “Is effed up, and you can do anything you want, and if it works, you get promoted, and if it doesn’t, you get fired”. I was like, “Perfect, that’s what I’m looking for”, so off I went.\nYou obviously succeed, you rise up to number two, then you set off this series of consolidation. What was the industry pressure that was happening around that time?\nSK:\nYou actually said it right. We, little America West, drove industry consolidation in the industry. The first merger was America West, the first I realized I was running the network and the commercial side of the business, we tried this experiment with the transcontinental markets, it failed miserably. Our most overlap was with the best airline in the world at the time, Southwest Airlines — we had to get bigger and change to survive.\nAnd so, the first deal we did was\nUS Airways\n, who was in bankruptcy at the time. People described it, one it’s impossible to raise money for. I had 52 meetings with investors trying to raise money for that, some of your tech clients will probably recognize me going around trying to talk to people about raising money, until one finally said yes. We raised a billion dollars, and got the merger done. We did it in September of 2005. By the way, so, two small airlines merging, the same month that both Northwest and Delta filed for bankruptcy, so a really tough time in the industry to do it.\nYup.\nSK:\nIt was really successful, right out of the gates it was successful. A year later, we made a hostile bid for Delta Airlines, who was in bankruptcy and planning to come out on a standalone basis. That drove changes in their executive team and board — we failed in that, but—\nRight, you had no idea what you were creating.\nSK:\nYeah. We knew we were creating a risk, or we knew that we were starting a ball rolling, we figured it was good no matter what happened. That caused\nDelta to then merge with Northwest\n.\nNext we went after United, and actually had a deal with United and I negotiated that deal along with their Chief Financial Officer who led the negotiations for United and I can remember going to dinner with her in Washington DC, which is where we’re all negotiating, we were even drafting the press release and she told me, “Just so you know, we’ve decided to leak this to test the market reaction”, and I knew we were in trouble when that happened, because it meant Continental would get in. Continental came in, and\nJeff Smisek\nhad one of the more infamous, he’s the CEO of Continental, quotes at the time that\nthey decided on the pretty girl instead of us\n,\nand they merged with United\n, but we drove that to happen.\nAnd then, of course, American files bankruptcy, and\nwe made a hostile bid against American\n. Everyone told us it was impossible, and we got it done. So, that little America West team, a bunch of young kids who really didn’t know enough to know that everything we were doing was just, in theory, impossible really changed the whole industry.\nIt may have seemed impossible, but, like you said, it completely changed everything. I presume you’re on board that consolidation has been good for the industry. Perhaps it’s a different question, has it been good for the consumer?\nSK:\nIt absolutely has been good for the consumer. You look at air travel today compared to where it was 20 years ago and it is a far better experience for you. You’re a frequent flier, it’s far better today. Back then it was just a heavily commoditized industry where the product, the service, the quality, the communication, none of that mattered. It was a pure, “Just get the lowest cost possible” industry, and it is much better for consumers today.\nAnd, by the way, it’s still a great value. In fact, I’ll just give you the most recent stats. In the six years pre-COVID to today, so, 2019 to 2025, airfares actually went down by about 2%, inflation was up 23%. Airport inflation, which drive our air costs, are up over 50%, airfares went down pretty significantly. That, by the way, is going to cause some ultra low-cost carriers to go out of business, already in bankruptcy, they’re going to go away, so a little bit of that is going to reverse. But airfares consistently for the whole period of deregulation have grown at much less than the rate of inflation, but the product and the service and the quality is infinitely better today than it was 20 years ago.\nTo go back to the poker bit, you have a reputation for being very data-driven and you mentioned, “Well, back then it was shooting fish in a barrel”, was that the case when you started at America West? Was just by virtue of looking at the numbers, being buried in spreadsheets, was that why you were able to take over the industry?\nSK:\nNo. We started with the weakest hand of cards at the table, we just played it the best, to keep the poker analogy, we had to bluff and bluster, we had the weakest hand, but we played it more aggressively than anyone.\nYou had nothing to lose.\nSK:\nWell, we did, we had the whole company to lose.\nRight.\nSK:\nBut we just played it more aggressively than anyone else. We also recognized that doing nothing was a huge risk in and of itself. In fact, one of the things I say, “The biggest mistake most people make in their careers is never making big mistakes”, they’re so afraid of taking risk that they miss all of the opportunities and we were balanced about recognizing the opportunities, but also the risks of doing nothing — deciding on the status quo is a decision in itself.\nActually, that reminds me of one of my favorite quotes is from Teddy Roosevelt that goes something like, “If you’re in a crisis, the best thing to do is quickly make the right decision, the worst thing to do is make no decision, and the second-best thing to do is to make the wrong decision. Do something!”.\nAirline Differentiation\nThat makes a lot of sense. You do talk much more, though, about things like the customer experience, and things that are not necessarily data-oriented.\nSK:\nYeah.\nIs that just part of softening the edges, as you know you’re one of the big three CEOs, or has it been a real shift in mindset?\nSK:\nWell, I think it is probably a shift in mindset, but it’s also something I’ve always thought. I am really good at data, I’m good at math, understand data, use data to inform my opinions, but data doesn’t tell you the answer. In the big questions, they’re uncertain and data helps inform your view of the world, but you can’t just rely on data. Doing something new and different is — you can’t ever use data to prove it, you have to trust your gut, trust your instinct. Two of my favorite quotes that are similar, but both Henry Ford and Steve Jobs. Henry Ford once said something like, “If you ask people what they want they’d say a faster horse”, and Steve Jobs famously never used surveys. I hate surveys, never used surveys, because you’re trying to invent and create something that people don’t know they want yet, you can’t get that from data. But data can inform your opinion, and help you build the foundation that lets you have the big leaps of insight.\nWas that the issue in the early 2000s when you were talking about everything was purely commoditized? Because if you did any survey you asked people what they want, they wanted direct flights, I would assume, and low prices.\nSK:\nYeah.\nAnd that was very tricky.\nSK:\nThat was the industry convention, and all the modeling, and all the math supported that and really no one had tried very hard to challenge that orthodoxy. And, for me, the first big challenge to that orthodoxy was JetBlue when they started, and they put live TV on the airplanes. I thought that was a gimmick at the time, but then I went and flew it and like, “Holy cow, this is a meaningfully different experience”.\nJetBlue was 12 or 13 airplanes at the time, and we had gotten up to 100 and so we cut a deal with a company that was called LiveTV to put live TV on all of the America West airplanes. They would have been growing eight or nine times with that contract, a huge transformative deal, live TV, nobody else is willing to do it, everyone else talked about it like a gimmick and it would have been the biggest CapEx investment outside of aircraft we’d ever made by far at America West, got the board to approve it.\nI called the CEO of LiveTV to tell him we got that done and he didn’t call me back, I’m like, “This is weird”, it took, like, 24 hours. I was starting to text people, or call people and say, “Is he okay?”.\nRight.\nSK:\n“Did something happen?”, he finally called me back, and he said, “I’m so sorry”, he said, “We told JetBlue that you were going to do the deal,\nand they bought the entire company\nto keep you from putting it on the airplanes”. So, that would have been like 2000 or something, maybe 2001, ’99 or 2000 probably, and that was my first big point of, “You can get people to pay for a better experience”.\nWell, tech is on the extreme in terms of thinking about massive fixed costs upfront, and then zero marginal costs in terms of actually serving customers.\nSK:\nYeah.\nAirlines are challenging. You mention that would have been one of your largest CapEx expenses ever. You have large fixed costs, you have the airplanes, but you also have ongoing marginal costs in terms of employees.\nSK:\nYeah.\nAlso fuel, which can be very much out of your control. When you’re thinking about managing these companies, or making that decision about this LiveTV, how do you think about balancing those different types of costs that go into your COGS?\nSK:\nYeah, we’re much more operating expenses as opposed to the CapEx. Our CapEx can be big but if you just look at depreciation, for example-\nIf you’re on a 30 year depreciation cycle, it doesn’t add up to much.\nSK:\nYeah, it’s a relatively low. Most of our expense is employees and labor and maintenance and landing fees and all things that are variable with how much you are actually flying. So, it’s very different than tech in that sense. But I think it’s probably similar in that you’ve got to make big bets upfront, particularly about the aircraft and what you’re going to do with the aircraft.\nRight, you’re stuck with them for a long time.\nSK:\nAnd that is the one decision, almost everything else you can fix that you screw up but if you make a bad fleet decision, that can be the unpardonable sin, that’s what’s happened to the ultra low cost carriers, they bought too many airplanes that are way too big. And when you do that, you can’t fix it because they are 30 year assets, when you make big fleet decisions, you bet the company. Those are decisions that you have to feel really good about the analytics, but at the same time, the analytics, who knows what’s going to happen in 30 years? Good grief, we don’t know what’s going to happen this year, much less the next 30 years.\nThis is the way I think of — people get lost in the spreadsheet, I often say, the spreadsheet doesn’t have the answer. The spreadsheet is good for, “Under this set of assumptions, here’s what the outcome is”, but in your brain, you’ve got to have a whole variety of differing assumptions to say, “I can make it through, I can live with this decision if things get a lot worse than I hope, if things get a lot better”. You’ve got to be able to think through a wide variety of outcomes, and the spreadsheet is just a starting point for the real analytical process that needs to go on in your brain.\nSo when I think about flying in general, just as just a consumer, I think of there being two markets, domestic and international. Given that I lived in Taiwan for most of the last two decades, I was obviously much more focused on international. When I get my 1K, I’m always on the miles or spend side, not on the segment side. Is that a division that you think about in terms of your business and your competitive set? It seems kind of obvious from the outside, do you think that it’s more of an integrated whole?\nSK:\nWe do, but they are an integrated whole. So, our flight from Taipei to San Francisco.\nTwo a day now, makes me happy.\nSK:\nYeah, it has a fair number of people that are connecting from other places. San Francisco is a great gateway, it’s the best gateway to the Pacific, we can connect the whole country. Obviously, given the tech and also just the heritage relationships between the Bay Area and Asia, there’s a lot of the traffic is coming locally, but a lot of it is connecting and from others. And there’s other divisions, business versus leisure travel, premium versus price sensitive so there are a lot of divisions, but we’re the largest international airline from the US. In fact, we fly to more cities internationally than all the other US airlines combined.\nSo when you talk about those, you talked about all those divisions, like premium versus low cost, or whatever it might be, what matters domestically? Is it different there? I think about domestic, I think about all the segmentation that you’ve been doing, for example.\nSK:\nSo, the primary way I think about the segmenting in the market is brand loyal customers versus price sensitive commoditized customers.\nThat makes sense.\nSK:\nAnd commoditized customers typically are, this isn’t a perfect distinction, but typically, people that don’t fly very much, they care about the schedule, so they’ll pay a premium for a nonstop. But all else equal, they don’t really care what airline they fly. They don’t fly enough to have be in the frequent flyer program, they’re just looking for the cheapest price, and it’s a commodity for them.\nThe brand loyal customers are the ones that we’ve focused on really trying to over-index on and when, and those customers care about the service, they care about the product, they care about the technology. I think one of the biggest and under-reported advantages-\nOh, we’re getting to that, don’t worry. We’re just building up, we’re building up to this.\nSK:\nBut the app on United, it’s like, I don’t know what airline in the world is second best, but there’s no question that they’re just a second.\nIt’s true. It is 100%, there’s no comparison.\nSK:\nYeah.\nUnited’s Tech Advantage\nWell, actually on that point, I had a little soliloquy here in the middle about my personal experience, because I’m very focused on international. So several years ago, I booked a business class flight on Singapore Airlines, long regarded as one of the best airlines in the world. I had to cancel that trip and it blew my mind that in order to get a refund, I had to submit a refund request, and it was literally a WordPress form on their website. I love WordPress, I’m very familiar with their ecosystem, doesn’t feel like the best tool for claiming a refund. I’ve told this story before in other contexts, but there’s an addition to it, which is in preparation for this interview, I went to find the email trail from this. It turns out they did email me eight weeks later asking why I wanted a refund, and I don’t think I ever got the refund.\nSK:\nOh, geez. You should go back!\nI know, we’re going back, it was an expensive ticket!\nSK:\nBy the way, I will tell you, there are some airlines, I know at least one in the United States, who do that on purpose because it helps what they call breakage. The harder they make it for you, like I’m talking about the things we were doing to make refunds easier, and putting up flight credits on our website and things so that you would know you had them. Somebody’s like, “Are you crazy?”.\n“Make people search for it!”\nSK:\nPeople will use them now instead of you just get to keep the money. I’m like, “Oh my God, you don’t understand the customer, thank God I’m competing with you”.\nWell, so anyhow, as I was filling out that stupid form, but I can remember thinking this in my head, I decided then and there, and I’m in Asia Pacific, so obviously it was United was the option, I was only flying United if at all possible, and the reason was solely because the website and the app were so superior to everyone else, by a massive margin. I could change flights, I could cancel, I could do whatever, I didn’t have to talk to anyone, and I followed through. I used to fly a lot more EVA Air, which is one of your Star Alliance partners, not the best partnership, I have complaints about that as well, but now I almost exclusively fly United. The one exception is EVA does have Taipei-Chicago direct flight, that one’s very nice, but to me, but this is the part that I always said I want to get to, I realized that for me, someone who flies a fair bit, changes my schedule a lot, nothing matters more than technology, and United had the best tech in the world. That’s my soliloquy. I think I’m putting the ball on a tee for you, but is this the sort of outcome that you foresaw when you come to United in 2016 and you start\nreally making these investments\n?\nSK:\nYes, but it’s been even more impactful than I thought, and I’ve always thought that using technology to anticipate a customer’s needs, solve them before, make it easy, treat them fairly, was more important even than things like the product. And you’re seeing with your Singapore Airlines experience, you can’t get over something like that when you treat people that way and force them that.\nYeah, walk me through this journey because again, I fly on a lot of airlines, I do fly United the most. How did your technology become so good? What was the change management process here? How did you go through it? What was it like when you showed up there?\nSK:\nSo one, we have a great team, we have great people. It’s the one part of the budget that’s been sacrosanct that I every year increase the budget, tell them to spend more money. Even during COVID, we didn’t cut it, so leading by example, but also pushing ideas really hard that are important, and pushing things that everyone thinks we shouldn’t do or that are impossible.\nI’ll give you one example. One of the biggest culture changes, this isn’t really customer facing directly, but it is indirectly, that we made was, as soon as I became CEO, I eliminated what are called delay codes. Every airline in the world has a delay code, if there’s a flight that’s even a one-minute delayed, “Is it the flight attendant’s fault?”, “Is it the pilot’s fault?”, “Is the FAA’s fault?” — somebody gets blamed, and that’s true at every airline in the world. And you’d have these meetings that would go on for hours where groups of people were trying to pin the blame on a different group and management teams at United and around the world say, “Oh no, we never hold anyone accountable for that, this is all about we have to have this data in order to run the airline”, and I just always thought it didn’t matter if people were held accountable or not. People didn’t have four or five hour meetings about a single flight if they didn’t think they were going to be held accountable and so that’s all that mattered — I just made them stop and they said it’ll be impossible to run the airline.\nWithin a couple of months, we now have built technology, we have better data to analyze what’s happening with delays and all the things that are happening, put cameras up, use AI, I use AI to figure out what’s going on, far better data than any airline in the world. And because of that, it also made our culture infinitely better. We took that off of the plate and told employees, “We want you to just do the right thing. You’re a team, work as a team. It doesn’t matter, there’s this delay, it doesn’t matter whose fault it is, you’re not going to get blamed”.\nIt’s transformational for the culture and we built a better data architecture that lets us start explaining delays to customers and doing things that no airline has the ability to do it, because they’re still doing paper and pencil, sitting in the conference rooms, blaming each other for delays. And that’s a deep in the weeds kind of thing, except what sounds like a simple decision, but it has done as much as anything to change not just the technology, but the culture at United.\nWhat has been the balance between the consumer facing tech changes, whether that be in the app — I know a manifestation of that data is you now have LLM generated explanations for why flight is delayed, which is very cool; I remember the first time I was sitting on the right side of the airplane, I got a notification that my bag was being loaded and I saw my bag going up the track, that was very cool — versus the stuff you’ve done on the backend, like managing your irregular operations, all those sorts of things. Is that a cohesive effort or you pick one thing to focus on and go back and forth? How do you think about that?\nSK:\nWe’re trying to do it all, because it all ties together. One of the big enablers was, that we started after I got here, we spent several hundred million dollars just getting off of our legacy mainframe systems, several hundred million rewriting code.\nIs that the key? That is the the key enabler?\nSK:\nThat was a key unlock. You can’t do what we do unless you do that first, it was a key unlock.\nSo, just for the nerds, what was the system that you were running on before?\nSK:\nOh, we were on, it was called SHARES, but it’s a\nFortran-based system\nthat was written in the ’60s.\nAnd so, what are you on now? Are you just on a regular cloud environment now?\nSK:\nWe’re on our own stuff. Yeah, it’s all cloud and it’s our own stuff, but we spent hundreds of millions. It’s not done. In fact, the last cutover’s coming next year for the last piece.\nOh, now I’m feeling nervous.\nSK:\nMost of it’s done.\nJust out of curiosity, when is the last cutover?\nSK:\nWell, we’ve done it a piece at a time. So none of them have ever been really impactful because you’ve done a piece at a time, and there’s several pieces next year, so they come, but we’ve never had any issues with it because we’ve done them a piece at a time. And when you do it a piece of time, there have been problems before, but it’s easy to roll back when you do it a piece at a time, relatively easier to roll back.\nHas anyone else done this?\nSK:\nNot that I’m aware. No, certainly not to the extent that we’ve done it. They’re still on old legacies, because it’s hard. If you’re sitting at airlines, which haven’t been great margin businesses, you’re sitting and somebody says, “I want to spend $150 million next year to just take it off of the legacy mainframe system and put it into modern coding system”.\nNo obvious, immediate benefit.\nSK:\nAnd there’s no ROI, there’s no nothing. “I don’t know what I’m going to be able to do with it, but it’ll just be easier to do stuff in the future”, I’m probably the only CEO that says yes to that, none of the others do.\nWhat was the process here? Who convinced you to do this? Why did you make the decision?\nSK:\nI think they did bring it to me, I’m not sure. Actually, I think I may have been the one that was pushing, “Let’s get off these systems”.\nIt’s okay, you can take credit.\nSK:\nPartly I was a programmer. I mean, I double majored, my other degree is comp sci, I understood it. When I was at the Pentagon, I got responsibility for managing a whole set of tech stack, I didn’t know Unix. I remember at the time, you’re going to be the system admin for a Unix system, and they gave me a manual that was three inches thick and at some point I erased the kernel, which took me about six months to recover from, but I learned a lot by doing that.\nBut anyway, I understood when I was working, I wrote Fortran and did those kinds of programs. It’s impossible to get anything done and you put it in a modern system, man, you can change it overnight. Try something new.\nI think that explains a lot. I mean, especially to people in our audience, if understanding you did this level of rewrite of the underlying system, no wonder you can roll out features so rapidly.\nSK:\nIn fact, I rewrote a couple of the programs that I was responsible for. Nobody asked me to, I just did it when I worked at the Pentagon and put them in Unix, put them in C, but on a Unix platform.\nThat’s super interesting. Well, to go back to the question about costs, because this ties into it — it strikes me about this, you just talked about it, it’s a real example of shifting spending to upfront costs. Was this something you had to convince the board of? Be like, “Look, this is as good as buying a bunch of new airplanes, it’s a similar cost”, or were you able to just make the call?\nSK:\nThe board has been really supportive of me and everything I’ve done. It helps when it’s all working — when you have a track record, they’re willing to give you a lot of rope. But not everything has worked, and when it doesn’t work, we pull it back, but they’ve been willing to give us a lot of rope.\nAnother thing that we do that’s totally different than every other airline is at the end of the year, when we go through our budget every year, I at the end of it say, “Here’s another 150, some number, millions of dollars that I want you to spend on the customer”, I don’t pretend to know what the best thing is, I hardly ever eat the food on airplanes, we spent a bunch more on food, we spent a hundred million more last year on upgrading the quality of wines. Not my thing, but other people do know.\nThat was my next question! Actually on this point though — wine is literally my next question — but when you did this commitment to rewrite, when you were thinking through as far as cost structure goes, and you mentioned that this has exceeded your expectations in terms of the benefits, but where did you expect it to manifest? Did you think you would get lower marginal costs, you’d be better, or did you see this being able to sustainably charge higher prices? What was your expectations, and how has it actually played out?\nSK:\nIt wasn’t about cost at all, it was about doing more for customers. My goal for 20 years has been, from a technology perspective, get to a world where if your flight is delayed or canceled, pretend I’m on the airplane and I’ve called our network operating center and asked them what’s going on, what would you tell me? I want to be able to automatically tell every customer that. And it was not going to be possible to do it when we were on those legacy systems.\nWe’re better by far than any other airline in the world at doing that, but I think we’re still in the pregame on getting it. I think we have the data architecture that allows us to do it, and AI is really the right tool to effectuate that and I think we’re getting much better at it, but we’re talking about including things like weather forecasts for your flight 24 hours out, so you can look at the maps of, “Here’s what’s happening”, if there’s weather coming into your city, here’s the other routes that you could take to get there. Just all kinds of cool stuff that will really give you very inside baseball of what’s going on, take some of that uncertainty away.\nYeah. Well,\nI know I talked to Flighty\n, you may be familiar, the flight tracking app, and he both agrees that you are by far the best app, and also feels like you keep stealing all his good ideas, so I think he means that as a compliment.\nSK:\nI think we talk to them a lot. In fact, I told our team, I don’t know what they’ve done, I shouldn’t say this in public, but I told our team, “We should just go buy Flighty, we’ll keep running it as Flighty, but I just want smart people that aren’t sitting at headquarters that believe anything is possible. Don’t tell me why we can’t do it, but go buy Flighty, and just let those guys tell us what to do”. They’re really good.\nI’ll let\n[Flighty Founder and CEO] Ryan [Jones]\nknow.\nThe Customer Experience\nWho had the idea to greet frequent flyers by name, and why wasn’t this always the case?\nSK:\nIt wasn’t me, but it’s part of enabling it with the technology. We also have your birthday in there, if you fly on your birthday, the flight attendants or someone will usually tell you happy birthday. We have all kinds of stuff like that about you.\nWell actually, my last birthday I took off from San Francisco on United on the 11:00 PM flight, and the day before my birthday, and I landed in Taipei the day after my birthday, so I missed my birthday completely.\nNo one noticed, alas.\nSK:\n(laughing) You’re supposed to go the other way, then you can do a double. Do a double New Year’s is the thing that people do, they start in Guam and fly to Honolulu on United, you can do a double New Year’s.\nWell, anyhow, I have the menu from my last flight here, because I did have a question about wine. I called you the best airline in the world a few years ago, I think on Twitter, solely because of the technology edge. And I sort of granted in the tweet, “Yeah, the food and wine aren’t as good and the flight attendant’s going to be grumpy and da, da, da, da”. Well, first off, being greeted by name helps a lot, I love it. Secondly, when and how did United suddenly have the best wine in the world? I told you this is literally my question on here. On this flight, I had a Mascot Cab, it’s a 4.5 on Vivino, a $200 bottle of wine. It was very, very good. The biggest problem is that every other wine on the list was also really good and I wanted to have all of them. Am I talking to the United CEO, or the Emirates CEO?\nSK:\n(laughing) That’s a high class problem. So really what happened on this was this was one of those at the end of the year I say — most airlines go back and say, “You have to cut the budget by X million dollars to meet our plan”, and I do the opposite and say, “Here’s how much extra we’re going to add, purely for customers”, and we have a great team. It’s led by\nAndrew Nocella\nand\nToby [Enqvist]\n, who’s our Chief Operations Officer, a whole bunch of people are involved in it. But they wanted to spend an extra $100 million on wine, and I trust him. Although I looked at, because I’m not a oenophile, I can’t tell the difference. I’m like, “Really? We’re going to spend $100 million on wine?”, because it’s like that is not what — I haven’t had a drink on an airplane in at least 20 years, so it’s just not what makes a difference to me. But I trusted them and they were right, and so we’re doing it next year. One of the wines they sent me, my wife and I had it.\nOh, there’s been a step up! So I noticed this happen about 16 months ago.\nI’m like, “Holy cow, there’s more good ones”, and then this year it’s actually taken another step up.\nSK:\nYeah. There’s some wine from South Africa, which I should know the name, because I drank it over the holidays, it was fine, it was good, I just can’t tell the difference. And they sent me one that’s coming on, that won some big award, global award. But anyway, that’s an example of hire great people.\nSo what makes this possible, why can you spend extra $100 million dollars?\nSK:\nBecause I’ve had a belief that air travel is not a commodity and that customers care. And no matter how good we are, we have to get better every year, or we will lose them, and we will deserve to lose them if we don’t get better every single year. And I believe that if we do that, we’re going to get market share, particularly for premium customers, or particularly for brand loyal customers who fly a lot, and they’re going to move to us, and that has worked like a charm.\nIn every one of our hubs, we’ve won massive market share since we started this. We do win every year, we get more market share, and it’s about having a long-term vision instead of the short-term. I’m just trying to maximize profitability for this year. In the short-term, it would probably be better to not spend that couple hundred million extra, but in the long-term, it’s a great investment to win customers for the future and so, we’re doing it, we’re going to keep doing it every year.\nHave you actually been preparing for better wine for basically your entire career? First, by driving consolidation such that there’s a possibility to pursue these things, then with the tech enabling these new features? And the payoff is I get to have a great glass of wine on this flight.\nSK:\nYeah, I wouldn’t have said it was going to be about the wine, but what I was trying to do was build an airline that could invest for customers and win brand loyal customers, could win not just on schedule and price, that was my goal. And wine wasn’t what was going to make the difference to me, but it is one of the things that makes a difference to a lot of other people.\nCompeting Internationally\nYou made some very interesting comments last fall about the US having what you call\na trade deficit\nwith international airlines. Explain that to me.\nSK:\nSo about two-thirds of the long-haul international seats are on international airlines, even though only about 40% of the passengers are international and that is because those airlines have different kinds of state subsidies. Quasi-monopoly positions, if you’re in Singapore, most airlines can’t fly and compete with them, most of the route, Middle East carriers — and I’m not complaining about that, by the way. The city of Dubai, the massively wealthy, impressive city state of Dubai doesn’t exist without Emirates, they go part and parcel together, it helped build it and Singapore doesn’t exist without Singapore Airlines. It’s important, it makes sense for those places to do that.\nBut we’re then trying to compete with airlines that are essentially loss leaders for their country, their city state and so we’re kicking around some ideas of we don’t want subsidies, not trying to hamstring or tie up the other competitors around the globe, but how do we rectify that trade deficit and get an equal amount of long-haul international traffic?\nWell, what are some examples of what you want?\nSK:\nWell, I can’t tell you yet.\nBut is this something where you need outside help, or you think you can do it yourself?\nSK:\nI don’t know what you mean by outside help.\nWell, I mean you’re starting to fix it to a certain extent.\nSK:\nSize would help.\nSize in what sense?\nSK:\nBeing bigger would help.\nAnd this is just more leverage on your costs?\nSK:\nWell, it’s that, and it’s more ability to actually have all of the US customers. You say you love United and you mostly fly it, but there’s a nonstop flight on EVA Air for Chicago, it’s the same thing, you look in a place like New York, it’s more fragmented. And so we have customers that fly United almost all the time or they fly Delta, but when they go to the Middle East, it’s fragmented enough that they fly on Emirates, and if we’re bigger and have more offerings for those customers, possibly, it makes it more rational for them to fly us when they go to the Middle East.\nAnd if we do that, then we can invest in — we would have the profitability cashflow to invest in better product, and really the place that the international airlines beat us is on product, premium product in particular. Ours is really good, all the US airlines are really good, all the European airlines are good, but they over-invest there. They lose money, but they over-invest there and that’s the gap that I am now thinking about how to close. I want us to be the best airline in the history of aviation and I think we’re already the best in the world, you said it too, but that’s collectively. We’re not the best at everything yet, and I’d like us to get closer to that.\nSo what’s the limitation in getting larger? Because I see two angles. One is can you even get airplanes? And then number two is, “We could cut an interesting deal with JetBlue, for example, if the government will let us, we could consolidate even more, that’s our bread and butter”.\nSK:\nYou’ve talked about the two interesting possibilities.\nWhich one is a harder nut to crack?\nSK:\n(laughing) They both have challenges.\nYou’ve had some\nspicy thoughts about Boeing\nin the past. How’s the relationship these days?\nSK:\nWell, we have a good relationship, but when they were stumbling I called them out on it, especially when they were stumbling and not willing to acknowledge that they were stumbling.\nI don’t mind people making mistakes, myself, people that work for me, I can’t stand excuses. The best thing I learned at the Air Force Academy is, “No excuses, sir!”, and I cannot stand when people make excuses. And when Boeing was screwing up and not acknowledging that they had problems, that meant they weren’t going to fix it.\nI think under [Boeing CEO] Kelly [Ortberg], they’ve done a really good job of getting on the right path, they’ve turned it around for the narrow bodies. Actually, the wide bodies, 77s have been a little behind, but we think we’re going to get 20 787s this coming year, we’re supposed to be getting 24 a year, but we only got 8 last year, and we’re going to be up to 20 this year, so I think they’re there. I think Boeing, the ship has been righted and I feel good about Boeing.\nJust to wrap up this part, the reason I was enthusiastic about this interview beyond being a United 1K flyer, I think it’s easy in the weeds of technology to forget why technology is critical for human welfare and improvement generally. From my point of view, to your point about facing some structural disadvantages relative to other airlines, you overcame that from my perspective with technology, and the great thing about that is it benefits everyone. Even the basic economy flyer gets to use the United App and website, maybe not the refund part of it, but then by extension, that gives you the cost structure to be able to offer me better wine. That’s pretty inspiring. But do you feel you’ve reached the limit of how much you can get from that?\nSK:\nNo, not at all. In fact, I think in some ways we’re just getting started. The gap in profitability, Delta and United this year, the two of us, they have a similar strategy, although I think they were ahead of us on starting it, but we’ve caught up and are passing them. But the two of us are going to be 100% of the industry profitability this year and the rest of the industry’s under strain because they’re very much in the commodity business, they focused on the commoditized travel. And so, I think as we continue to get better, the pressure on them gets higher.\nI think it’s going to lead to a better outcome for us, better outcome for our customers as well, but I think those leads are only set to grow and we’re ahead of all of our competitors. You take technology, we’re ahead. I can almost guarantee you that we’re investing more next year than anyone else — even though we’re ahead, we’re investing more. I tell our team, I said earlier on this, our job is to come up with cool stuff to wow you every year and we don’t get to take credit for the things we did last year. We got to do new stuff every year, or we’ll lose customers and that’s our attitude and we’re going to keep it going, and no one else is doing it, so it’s just remarkable to me. We’re doing all this and no one’s copying the things that matter, which is great.\nDoes it go back to just because you have to rewrite the entire foundations of the technology stack?\nSK:\nIt does. And it’s that, and it’s also a finance-driven, it’s short-term finance-driven cultures that if you can’t prove this has an ROI, you can’t do it. And as data-driven as I am, all the big decisions that I’ve made in my life, there was no way to calculate the ROI on those decisions. It’s just like you’re playing poker. There’s no way to know for sure what the other guy has, and you make bets when they’re good bets, and they’re just not willing to make bets.\nHow do you actually tell this story? Because I think that was one of my fun things to drop on Twitter, “Oh, United is actually the best airline in the world”, because it outrages a lot of people who have, whether it be stories of people dragging them off planes or their guitar or whatever, or their own personal experience with delays, people always blame the airline for everything. How do you actually convince people that it actually is different now? Or is it just a matter of people who fly a lot, they will pick up on it and you can be in Chicago and take over the market, for example.\nSK:\nPeople that fly a lot do pick up on it, but we’re certainly not perfect, and there are things where we screw up and I hear stories and I’m like, “Ugh, I can’t believe we did that”, but when I hear those kinds of stories, I think, “How do we make that better? How do we change that?”. It’s not an excuse, how do we change it and make it better? And technology has been a big part of it.\nOne of the things, we didn’t talk about it really, but we had this, we called it Hell Week in Newark, where the airport was closed. It was a combination of storms and the FAA, we came close to needing to shut down Newark to recover, we didn’t quite get there, but we came close. And you dig through it all, at the root of it was technology problems with crew scheduling, just archaic processes.\nOne of them, we went out to the NOC, network operating center, the week after it to thank people for all the hard work and to talk to them, but also just to talk to them, and I’d never really focused on it. I was at the crew desk and talking to them, being like, “Why does it take us so long to get our crew?”, they were talking about how we had so many to repair and we just were behind and it just kept snowballing on us. And it turned out that we were making phone calls to every crew member that got reassigned. So you have a storm come through, you need to cancel 200 flights. Well, there’s an average of four flight attendants per flight, two pilots, so you’ve got to make 1,200 phone calls, and most of the time, people don’t answer the first time. And our crew desk was on the phone, 95% of their time was on the phone.\nI was like, “Why are we doing that? Why don’t we just text them?”, “Oh, our union contract said they have to have a call”, “Well, why don’t we robocall them?”, and it was like, “What are you talking about? We can’t do that”. Three months later, we robocall them and it’s perfect. It’s better for employees, you just tell them what it is, it’s better for everyone, but we completely re-architected how we manage crews. And now, when we have these big events, we watch other airlines like, “Oh, they’re about to get in trouble, you can tell they’re in trouble”, and we’re able to repair and go on. It was great during the shutdown and other places but just the investments that we’ve made operationally and for the customers really just make the experience better.\nAI & Starlink\nWhat about AI? AI, in some respects, you’ve been using machine learning for a lot of things, it’s a big part of your investment. You do have the LLM-generated text about why your flight is delayed. Everyone wants to talk about AI, I feel compelled to give you an opportunity to say something about it.\nSK:\nYeah, sure.\nBut we’re also talking about airplanes in the sky. Does it really matter?\nSK:\nI’ll tell you what we’re doing, and then if you want me to, I’ll give you my broader view on AI, which is different than everyone else and won’t be as popular.\nSo I think AI is a wonderful tool for many classes of problems. Our ability to communicate with customers and tell them exactly what’s going on in a delay is one example of that. We’ve got some work that we’ve done with AI on airspace when storms happen, because we have this massive dataset, we started in Denver — decades of data of when storms hit, which routes are open, what’s the best way to sequence aircraft in, and we can make the Denver airport dramatically more efficient, we can do it at every airport, dramatically more efficient with AI. At the moment, it’s a challenge, because the FAA can’t ingest that data, they have not modernized their systems and can’t ingest that data, but it creates benefits for us anyway.\nBut also, we’re experimenting with the art of the possible for the future to run the airline better. Essentially, our network operating center, the brains of the airline, I think almost everything we do in there, AI can do it better than humans can do it, because we can look at — we have massive data sets, it’s pretty easy to define the objective function of what it can do, and it’ll be really good.\nBut I will put myself in the distinct minority of people on the broader level about AI and the gradient descent models that are driving AI, that I do not think we’re going to get to artificial general intelligence with that, and I think there’s a whole class of problems that they are terrible at that they’re being used for.\nOn the consumer AI use, I’ll give you two things that I dislike about it. They’re good at selling you stuff that they want you to buy, and the emperor has no clothes, telling you what you want to hear. My simple example, go to AI and ask it, “Where can I watch Landman? Which streaming service can I watch Landman, or any other show, for free?”, you cannot find it. It’s maybe a hundred pages down, I haven’t gone far enough, it’s all advertising. And then, the second one, I’m telling you what you want to hear. It’s designed, that’s the feedback it gets, to tell you what you want to hear. My mom recently broke a bone in her back and she’s laid up, and on the 12th day, things weren’t getting better and it was getting worse, so she was using ChatGPT, and she asked it, “I was really doing good and this is my 12th day and it’s really bad”, and it gave her this detailed, “You used to be acute, now you’re subacute”, all these terms, and said, “But this is normal on the 12th day”. That’s BS, that’s not right. So I got on a different device and said, “On my 12th day, I felt remarkably better”, and the same system told me, “That’s normal, on the 12th day, you get remarkably better”, it is designed to tell you what you want to hear, not what you need to hear.\nSo my caution to people with AI is I think brain power is still really important and the ability to think independently. AI can be used for some things, but you need to still use your brain.\nWhy did you make\nthe jump to Starlink\n? Obviously, Hawaiian had been there and I used it on JSX years ago. You’re the first big airline. Now, Air France is on, Lufthansa just announced today, what made you take the leap?\nSK:\nI knew for a long time that we were going to go, for a while, that we were going to go. It’s a step function improvement in technology, no one else can get there and others are going to try to launch Low Earth orbit satellites, but good grief, they’re light years behind, they’re not going to get there. So Starlink was going to be the answer.\nIt took time to negotiate, because we wanted to own the consumer data, and at the beginning, Starlink did, so that was hard, and then, the other thing was I wanted to let my big competitors in the United States finish their deals with other providers and get locked in so that we would — eventually, everyone’s going to have Starlink.\nThat’s my question.\nSK:\nBut it’s going to take them time. They don’t know it yet, but it’s going to take time, they don’t know it yet. And every day that they don’t put it on their airplanes, it is one more day of advantage for us.\nThat’s my view\n, Starlink is going to be a monopoly in the long run. Are you worried about that or are you just like, “Yeah, you’ll have to pay for it eventually”, but for now, you get differentiation for the next however long?\nSK:\nWe’re going to be way ahead, and then we’re going to come up with the next great thing. They’re going to always be behind us.\nHow important is advertising to this deal, to having all the seat-back devices? The main thing to use it, you have to be a MileagePlus member, that gives an identifier, you know who they are.\nSK:\nYeah. I think the advertising piece is the icing on the cake. It’s not the cake, but it’s icing on the cake.\nSo it’s not going to be a material driver, or maybe it will be someday?\nSK:\nNo, I think it’ll be a big financial issue. But I really am focused on winning customer loyalty, we’ll get some bigger payoff for that.\nIs the real payoff credit cards? Are you actually a credit card company?\nSK:\nNo, we really aren’t, that’s a bit of a misnomer. We’re a loyalty company and credit cards are part of it, but the credit card doesn’t exist unless you can take the cool, exotic vacation to Tahiti or Cape Town or wherever you want to go.\nI just want to board early, that’s all I care about, and I want to be greeted by name. That’s the thing is the higher you get, the less the perks matter.\nI have three quick things, I know we have like three minutes left, my own personal beefs. Number one, one underrated thing about United is you have the best bedding in the industry. Two blankets, two pillows, good for me as a warm sleeper. Please, don’t change this, don’t cheap out on this.\nSK:\nOkay. By the way, I’ve never used the bedding either, because I go to sleep as soon as the plane takes off the runway.\nYou never put your seat down, yeah. Well, that little gel pillow is amazing.\nYou have a shop online\nthat lets you buy United onboard items, it does not have the gel pillow, I need a way to buy this pillow, so that’s number one.\nNumber two, SFO. As an American, I appreciate the egalitarian nature of baggage carousels in US airports, which means that your status has zero impact on when your bags come out, unlike in Asia, the status bags always come out first. However, after waiting for one hour for bags last week and almost missing my connecting flight, I need to pull my elitist card and ask you to fix that.\nSK:\nOkay. Here’s two things. One, that obviously implies, that you were waiting on a connection, that you were coming in international. My number one ask to change something with this administration, and I think we’ve got a chance at getting it done, is it is ridiculous that you have to collect and recheck your bag.\nIt’s absurd.\nSK:\nIt’s a hangover from the\nLockerbie disaster\nwhen all the systems and technology and security protocols were different. It’s a perfect example of government inertia. There are tens of thousands of government employees who are working on that, millions of hours of lost time for you and other customers, and it is totally unnecessary.\nIt’s pointless.\nSK:\nTotally unnecessary. I’m working to get that changed.\nNo one checks it anyway, I just walk in and drop it right back in. All right, thank you. Good, that’s even better.\nSK:\nYou shouldn’t need to touch it. If you fly domestically, you don’t have to touch it. We’ve already scanned your bag for security somewhere else in the world, we know it’s safe. Why, because it’s international, do we have to touch it? It makes no sense at all.\nWell, that’d help your business too. You could do more connections international-international.\nSK:\nYeah.\nNumber three, I know the build up of Denver means this isn’t going to happen, but you had a Madison-San Francisco flight that died during COVID. Please, I want you to bring it back.\nSK:\nNo, no, no, that flight did well. The issue with San Francisco right now is the runway construction this year, and so we have fewer flights than normal because the runway construction’s been going on this year.\nSo you’re saying there’s a chance?\nSK:\nI’m telling you there’s a chance,\none of the best lines in the history of movies\n, you’re telling me there’s a chance. I love that line.\nScott Kirby, thank you very much.\nSK:\nThanks, Ben.\nThis Daily Update Interview is also available as a podcast. To receive it in your podcast player,\nvisit Stratechery\n.\nThe Daily Update is intended for a single recipient, but occasional forwarding is totally fine! If you would like to order multiple subscriptions for your team with a group discount (minimum 5), please contact me directly.\nThanks for being a supporter, and have a great day!\nShare\nClick to share on Facebook (Opens in new window)\nFacebook\nClick to share on X (Opens in new window)\nX\nClick to share on LinkedIn (Opens in new window)\nLinkedIn\nClick to email a link to a friend (Opens in new window)\nEmail",
    "canonical_url": "https://stratechery.com/2026/an-interview-with-united-ceo-scott-kirby-about-tech-transformation/",
    "word_count": 10894,
    "content_hash": "91946541ff20f9b4849a2fa2b85badedd4c4de2cded913ec9e3bcf0887c25022"
  },
  {
    "title": "Apple and Gemini, Foundation vs. Aggregation, Universal Commerce Protocol",
    "publication_date": "2026-01-13T06:00:00-05:00",
    "cleaned_text": "Listen to this post:\nYour browser does not support the audio element.\nGood morning,\nAs part of my\none-man crusade to resuscitate the Apple Vision Pro\n(“Live in Your Living Room”), I ranted about Apple’s unnecessary production on\nDithering\n, and then on\nTBPN\nexplained why I think that making the Vision Pro about live events could, in the long run, make the device a much more compelling productivity tool as well.\nOn to the Update:\nApple and Gemini\nFrom\nCNBC\n:\nApple is joining forces with Google to power its artificial intelligence features, including a major Siri upgrade expected later this year. The multiyear partnership will lean on Google’s Gemini and cloud technology for future Apple foundational models, according to a joint statement obtained by CNBC’s Jim Cramer. “After careful evaluation, we determined that Google’s technology provides the most capable foundation for Apple Foundation Models and we’re excited about the innovative new experiences it will unlock for our users,” Apple said in a statement Monday. The models will continue to run on Apple devices and the company’s private cloud compute, the companies added. Apple declined to comment on the terms of the deal. Google referred CNBC to the joint statement.\nGoogle added in a statement\non X\n:\nApple and Google have entered into a multi-year collaboration under which the next generation of Apple Foundation Models will be based on Google’s Gemini models and cloud technology. These models will help power future Apple Intelligence features, including a more personalized Siri coming this year.\nAfter careful evaluation, Apple determined that Google’s Al technology provides the most capable foundation for Apple Foundation Models and is excited about the innovative new experiences it will unlock for Apple users. Apple Intelligence will continue to run on Apple devices and Private Cloud Compute, while maintaining Apple’s industry-leading privacy standards.\nI analyzed this partnership in depth when Mark Gurman reported it was coming\nin November\n:\nStart with the implications of Apple white-labeling a model for Siri in the first place. First off, I think this is the right move; there is no evidence, either from history or from the company’s capital expenditure numbers, that Apple has the capability to compete on the leading edge of AI model development. At the same time, Apple doesn’t need to be highly differentiated in this regard, at least not now: we just saw that the company’s products are as popular as ever; what the company needs is to have something that is “good enough”. In other words, what is “best” actually doesn’t have much to do with “better”; “good enough” is sufficient.\nThe context of that paragraph was Gurman’s reporting that Apple chose Gemini over Anthropic’s Claude, which, at that time, was regarded as a better model; I made the case that Apple didn’t necessarily need the best model, and it was reasonable to consider things like price, infrastructure, familiarity, etc., because Apple simply needed to be in the game. Therefore, Gemini made sense.\nHowever, I probably should have realized that Apple was almost certainly getting access to upcoming models at that point, which means they were evaluating Gemini 3, which is obviously very strong and arguably state of the art. Regardless, the points about price, infrastructure, and familiarity all hold — if that comes with the best model, all the better!\nFoundation vs. Aggregation\nIt’s also worth specifying what exactly Apple is getting: this is not a replacement for the OpenAI partnership, wherein Siri bounces some queries to ChatGPT; rather, this deal is about the foundational model undergirding Siri itself. The game that Apple is bowing out of is pre-training, where you ingest astronomical amounts of data to create a foundation model; that foundation model is a token-generation engine.\nSimply spitting out tokens, however, is not a product: the product aspect of models comes from post-training, where you make that token generation coherent, you provide guardrails, you add specific skills, and where you give the model a personality. In other words, this is the step where you make the model Siri. To that end, I’m not surprised that this announcement was so low key: I don’t expect the name “Gemini” to appear anywhere in the Siri product, at least outside of a product credits page where they list things like open source licenses. Siri will still very much be an Apple creation, it will just rest on a Gemini foundation.\nThere is, as I noted last November, long-term risk here; Apple didn’t say anything about continuing to develop their own foundational models, but I think this seals their fate:\nStill, Apple’s plans are a bit like the alcoholic who admits that they have a drinking problem, but promises to limit their intake to social occasions. Namely, how exactly does Apple plan on replacing Gemini with its own models when (1) Google has more talent, (2) Google spends far more on infrastructure, and (3) Gemini will be continually increasing from the current level, where it is far ahead of Apple’s efforts? Moreover, there is now a new factor working against Apple: if this white-labeling effort works, then the bar for “good enough” will be much higher than it is currently. Will Apple, after all of the trouble they are going through to fix Siri, actually be willing to tear out a model that works so that they can once again roll their own solution, particularly when that solution hasn’t faced the market pressure of actually working, while Gemini has?\nIn short, I think Apple has made a good decision here for short term reasons, but I don’t think it’s a short-term decision: I strongly suspect that Apple, whether it has admitted it to itself or not, has just committed itself to depending on 3rd-parties for AI for the long run. And, I might add, this could work out very well. Just look at the Services revenue example above: Apple’s position as the most desirable hardware platform means it is benefiting massively from AI revenue growth; similarly, Apple’s ownership of the user experience on the most important platform means it can treat model builders as suppliers — and cleverly, by not advertising who makes the model, it retains the option to switch suppliers in the future if necessary.\nThe real risk happens much further down the road, if AI actually disrupts the smartphone paradigm, or becomes the UI of the future. Apple surely is telling itself that it will keep building models just in case such a future comes to pass, but again, I struggle to see how the company will keep up. Google is going to be so much better at this, and is charging so little, probably to ensure that Apple never truly tries.\nIt’s the exact same strategy as search\n…\nApple is in a desperate enough position that they aren’t getting paid to use Gemini; they are an attractive enough customer, however, that Google is putting in real work to make Gemini run on Apple’s infrastructure for a mere $1 billion a year. Maybe Apple can simply ask that the money be taken out of the search deal! And, by the way, the lack of branding works for Google too: if Siri still stinks Gemini’s brand isn’t hurt.\nIn fact, there is a way that Apple might have its cake and eat it too. Remember, this deal does not replace OpenAI; that, though, means there is potentially another deal to be made. From\nAlex Heath at Sources\n:\nSources say that Sundar Pichai and Google’s other leaders hope this initial deal on underlying model technology will lead to the same kind of product integration that ChatGPT currently enjoys on iOS and macOS. Even though it recently won its search antitrust case, Google would not dare try to fully replace ChatGPT as the only third-party assistant on Apple devices, of course. Such a move is still too risky, given how closely governments around the world are still scrutinizing Google and any big AI deal. But Google would love to make Gemini available as an alternative to ChatGPT on Apple’s billions of devices.\nBack when Apple first announced Apple Intelligence\nI was optimistic that Apple could Aggregate AI\n:\nTo put it another way, and in Stratechery terms, Apple is positioning itself as an AI Aggregator: the company owns users and, by extension, generative AI demand by virtue of owning its platforms, and it is deepening its moat through Apple Intelligence, which only Apple can do; that demand is then being brought to bear on suppliers who probably have to eat the costs of getting privileged access to Apple’s userbase.\nThe big problem with this vision is that it assumed that Apple Intelligence would be competent, and it simply wasn’t; just as the iPhone search deal wouldn’t be worth much if the iPhone sucked, Siri chatbot integration isn’t worth much if Siri sucks. Now, however, Google is selling the underlying model to make Siri good, and their biggest hope is that they can pay Apple all of their money back — and more! — to have a money-making Gemini sit on top.\nUniversal Commerce Protocol\nFrom\nTechCrunch\n:\nGoogle on Sunday announced a new open standard called the Universal Commerce Protocol (UCP) for AI agent-based shopping, at the National Retail Federation (NRF) conference. The standard, developed with companies like Shopify, Etsy, Wayfair, Target, and Walmart, lets agents work across different parts of customer buying processes, including discovery and post-purchase support.\nThe core idea is that the standard could facilitate these various parts of the process instead of requiring connections with different agents. Google said that it also works with other agentic protocols, such as Agent Payments Protocol (AP2) — which Google announced last year — Agent2Agent (A2A), and Model Context Protocol (MCP). The company specified that Agents and Businesses can pick and choose specific extensions of the protocol that suits their needs.\nThe company said that it will soon use UCP for eligible Google product listings in AI mode in search and the Gemini apps to let shoppers check out directly from U.S.-based retailers while researching a product. Users will be able to pay using Google Pay and pass on the shipping information saved in the Google Wallet. Google said that it will soon support PayPal as a payment option.\nThis announcement is a bit in the weeds, particularly as it follows on to OpenAI’s announcement of the\nAgentic Commerce Protocol\nlast\nSeptember\n. Broadly speaking, both protocols enable instant checkout type of experiences within AI workflows; there are, however, subtle differences that speak to how OpenAI and Google view their relative positions.\nIn short, to dramatically simplify, the OpenAI and Stripe pioneered Agentic Commerce Protocol is about enabling purchases from within ChatGPT (yes, it’s an open standard, but it was clearly built for ChatGPT). Merchants provide a formatted list of their goods to ChatGPT, and then Stripe facilitates a purchase that keeps the 3rd-party as the merchant of record. More generally, Agentic Commerce Protocol is focused on a world where the commerce journey exists entirely within ChatGPT.\nThe Universal Commerce Protocol, on the other hand, is much more ambitious (and complicated). You can define every aspect of the e-commerce funnel, from discovery to catalog to checkout to order history to returns to loyalty etc.; those aspects can then be consumed by anything, whether that be a chatbot, an agent, etc. This is much more work, but, if done well, both preserves more control for the merchant and also makes the entirety of their experience much more broadly available than just in a chatbot.\nThis is very much classic Google. Google, particularly early Google, doesn’t want walled gardens; rather, it wants to tear down all walls and make everything generally accessible. Yes, in theory that creates the conditions for competition, but in reality Google can bring to bear its massive user base to most efficiently and effectively harvest and wield broadly available digital abundance — think Google Search leveraging the open web versus, say, Yahoo and its portal, or AOL and its walled garden.\nIn other words, the point of the Universal Commerce Protocol is right there in the name: Google wants all information and potential activities everywhere to be universally accessible, because when no one has a structural advantage or a wall around their garden then Google actually has the biggest advantage of everyone. That, by extension, will create the conditions for Gemini to actually make money — and outbid OpenAI for the actual branded spot atop Siri.\nThis Update will be available as a podcast later today. To receive it in your podcast player,\nvisit Stratechery\n.\nThe Stratechery Update is intended for a single recipient, but occasional forwarding is totally fine! If you would like to order multiple subscriptions for your team with a group discount (minimum 5), please contact me directly.\nThanks for being a subscriber, and have a great day!\nShare\nClick to share on Facebook (Opens in new window)\nFacebook\nClick to share on X (Opens in new window)\nX\nClick to share on LinkedIn (Opens in new window)\nLinkedIn\nClick to email a link to a friend (Opens in new window)\nEmail",
    "canonical_url": "https://stratechery.com/2026/apple-and-gemini-foundation-vs-aggregation-universal-commerce-protocol/",
    "word_count": 2192,
    "content_hash": "444f96d4730924701bc5fcd28e2e08005371dba3e1d8b46b7fa0092f1836c28b"
  },
  {
    "title": "Apple: You (Still) Don’t Understand the Vision Pro",
    "publication_date": "2026-01-12T06:00:00-05:00",
    "cleaned_text": "Listen to this post:\nYour browser does not support the audio element.\nDear Apple,\nI was, given my interest in virtual and augmented reality, already primed to have a high degree of interest in the Vision Pro, but even so, I appreciate how you have gone out of your way to make sure I’m intrigued.\nYou let me try the Vision Pro the day it was announced\n, and while\nI purchased my own the day it shipped\n(and had it flown over to Taiwan), you recently sent me a demo version of the M5 Vision Pro (it’s definitely snappier, although I don’t like the Dual Knit Band at all; the Solo Knit Band continues to fit my head best).\nHowever, the reason I truly know you are trying to win my heart is that not only did you finally show a live sporting event in the Vision Pro, and not only was it an NBA basketball game, but the game actually featured my Milwaukee Bucks! Sure, I had to jump through VPN hoops to watch the broadcast, which was only available in the Lakers home market, but who am I to complain about watching Giannis Antetokounmpo seal the game with a block and a steal on LeBron James in my M5 Vision Pro?\nAnd yet, complain I shall: you have — like almost every video you have produced for the Vision Pro — once again shown that you fundamentally do not understand the device you are selling. I’m incredibly disappointed, and cannot in good faith recommend any model of the Vision Pro to basketball fans (or anyone else for that matter).\nSports on TV\nApple, you are one of the grandfather’s of the tech industry at this point; it’s hard to believe that you are turning 50 this year! Still, you are much younger than TV generally, and sports on TV specifically. The first U.S. television broadcast of a sporting event was\na Columbia-Princeton baseball game on May 17, 1939\non NBC; there was one camera accompanying the radio announcer. Three months later NBC televised the first Major League Baseball game between the Brooklyn Dodgers and Cincinnati Reds; this time they used two cameras.\nAll televised sports face a fundamental limitation when it comes to the fan experience: the viewer is experiencing something that is happening in real life 3D on a 2D screen; the solution NBC discovered from the very beginning was to\nnot\ntry and recreate the in-person experience, but to instead create something uniquely suited to this new medium. Two cameras became three, then four, then 147 — that’s how many cameras Fox used for\nlast year’s Super Bowl broadcast\n. Of course many of those cameras were specialized: included in that number were 27 super slow motion cameras, 23 high resolution cameras, 16 robotic cameras, 10 wireless cameras, and two SkyCams.\nThe job of stitching all of those cameras together into one coherent broadcast falls on the production team, housed in a specially equipped truck outside the stadium; that team coordinates with the broadcast booth to provide a seamless experience where every jump feels natural and pre-meditated, even though it’s happening in real time. It’s a great experience!\nAnd, of course, there is the pre-game, half-time, and post-game shows, which used an additional 64 cameras, including 12 wireless cameras, eight robotic cameras, seven augmented reality cameras, and a FlyCam. No broadcast is complete without something to fill the time when the game isn’t on. After all, as advanced as TV broadcasts may be, they still face the fundamental limitation that confronted NBC: how do you translate an in-person experience into something that is compelling for people on their couch looking at a 2D screen?\nVision Pro Disappointments\nWhen I first tried the Vision Pro the demo included a clip from an NBA game that was later cut from the demo that shipped with the device (which was the one available in Apple Stores); it jumped out at me\nat the time\n:\nWhat was much more compelling were a series of immersive video experiences that Apple did not show in the keynote. The most striking to me were, unsurprisingly, sports. There was one clip of an NBA basketball game that was incredibly realistic: the game clip was shot from the baseline, and as someone who has had the good fortune to sit courtside, it felt exactly the same, and, it must be said, much more immersive than similar experiences on the Quest.\nIt turns out that one reason for the immersion is that Apple actually created its own cameras to capture the game using its new Apple Immersive Video Format. The company was fairly mum about how it planned to make those cameras and its format more widely available, but I am completely serious when I say that I would pay the NBA thousands of dollars to get a season pass to watch games captured in this way. Yes, that’s a crazy statement to make, but courtside seats cost that much or more, and that 10-second clip was shockingly close to the real thing.\nWhat is fascinating is that such a season pass should, in my estimation, look very different from a traditional TV broadcast, what with its multiple camera angles, announcers, scoreboard slug, etc. I wouldn’t want any of that: if I want to see the score, I can simply look up at the scoreboard as if I’m in the stadium; the sounds are provided by the crowd and PA announcer. To put it another way, the Apple Immersive Video Format, to a far greater extent than I thought possible, truly makes you feel like you are in a different place.\nThe first thing that has been frustrating about the Vision Pro has been the overall absence of content; Apple, you produced a number of shows for launch, and then added nothing for months. The pace has picked up a bit, but that has revealed a second frustration: I think that your production stinks!\nOne of the first pieces of sports content that you released was an MLS Season in Review immersive video in March 2024; I wrote in\nan Update\n:\nI have a lot to say about this video and, by extension, the Vision Pro specifically, and Apple generally. Let me work my way up, starting with the video: it’s terrible. The problem — one that was immediately apparent before I got into all of the pedantry below — is that while the format is immersive, the video is not immersive at all. This is the big problem:\nThis is a screenshot of a stopwatch Mac app I downloaded because it supported keyboard shortcuts (and could thus use it while watching the immersive video). There are, in a five minute video, 54 distinct shots; that’s an average of one cut every six seconds! Moreover, there wasn’t that much gameplay: only 2 minutes and 32 seconds. Worse, some of the cuts happen in the same highlight — there was one play where there was a sideline view of the ball being passed up the field, and then it switched to a behind-the-goal view for the goal. I actually missed the goal the first time because I was so discombobulated that it took me a few seconds to even figure out where the ball was.\nIn short, this video was created by a team that had zero understanding of the Vision Pro or why sports fans might be so excited about it. I never got the opportunity to feel like I was at one of these games, because the moment I started to feel the atmosphere or some amount of immersion there was another cut (and frankly, the cuts were so fast that I rarely if ever felt anything). This edit may have been perfect for a traditional 2D-video posted on YouTube; the entire point of immersive video on the Vision Pro, though, is that it is an entirely new kind of experience that requires an entirely new approach.\nI had the exact same response when you released a video of a Metallica concert\nlast March\n:\nAs for the concert itself, the video was indeed very cool. The opening shot following James Hetfield walking into the stadium was very compelling, and, well, it was immersive. And then you cut to another camera angle, and while that camera angle was also immersive, the video as a whole no longer was.\nWhat followed was a very enjoyable 30 minutes or so — I’ll probably watch it again — but it felt like a particularly neat documentary, not like I was at a concert. You had a monologue from each member of the band, you had shots of the crowd, you had three songs, all, as Apple proudly noted in their press release, shot with “14 Apple Immersive Video cameras using a mix of stabilized cameras, cable-suspended cameras, and remote-controlled camera dolly systems that moved around the stage.” That means the final product was edited together from those 14 cameras and the four interviews, which is to say it was a produced artifact of a live experience; at no point did I feel like I was at the concert.\nNews flash: I didn’t watch the video again. I’m just not that interested in a TV-style documentary of Metallica. I added:\nWe are nearly two years on from that introduction, and over a year beyond the actual launch of the Vision Pro, and there has yet to be an experience like I envisioned and thought was coming. What is frustrating is that the limiting factor is Apple itself: the company had 14 Apple Immersive Video cameras at this concert, but what I want is only one. I want an Apple Immersive Video camera planted in the audience, and the opportunity to experience the concert as if I were there, without an Apple editor deciding what I get to see and when.\nNeedless to say, you probably already know why I thought Friday’s telecast was a big disappointment.\nBucks vs. Lakers\nI understand, Apple, why it’s not easy to record or even take a screenshot of a copyrighted game; please bear with me while I describe the experience using text.\nWhen I started the broadcast I had, surprise surprise, a studio show, specially tailored for the Apple Vision Pro. In other words, there was a dedicated camera, a dedicated presenter, a dedicated graphics team, etc. There was even a dedicated announcing team! This all sounds expensive and special, and I think it was a total waste.\nHere’s the thing that you don’t seem to get, Apple: the entire reason why the Vision Pro is compelling is because it is\nnot\na 2D screen in my living room; it’s an immersive experience I wear on my head.\nThat means that all of the lessons of TV sports production are immaterial.\nIn fact, it’s worse than that: insisting on all of the trappings of a traditional sports broadcast has two big problems: first, because it is costly, it means that less content is available than might be otherwise. And second,\nit makes the experience significantly worse\n.\nJump ahead to game action. The best camera was this one on the scorer’s table:\nI have, as I noted, had the good fortune of sitting courtside at an NBA game, and this very much captured the experience. The biggest sensation you get by being close to the players is just how tall and fast and powerful they are, and you got that sensation with the Vision Pro; it was amazing.\nThe problem, however, is that you would be sitting there watching Giannis or LeBron or Luka glide down the court, and suddenly you would be ripped out of the experience because the entirely unnecessary producer decided you should be looking through one of these baseline cameras under the hoop:\nThese are also not bad seats! I’ve had the good fortune of sitting under the basket as well. These are the seats where you really get a sense of not just the power but also the physicality of an NBA game: I would gladly watch an entire game from here. But alas, I was only granted a few seconds, before the camera changed again.\nThis was absolutely maddening — so maddening, that I am devoting a front page Article to a device no one but me cares about, in the desperate attempt to get someone at your company to listen. What makes the Vision Pro unique is the sense of presence: you really feel like you are wherever the Vision Pro takes you. In other words, when I’m wearing the Vision Pro, and the camera actually stays fixed — like, for example, when you set up a special fourth camera specifically for the Lakers Girls performance, which I think was the single longest continual shot in the entire broadcast — I get the sensation of sitting courtside at Crypto.com Arena, and it’s amazing. Suddenly $3,499 feels cheap!\nHowever, when I’m getting yanked around from camera to camera, the experience is flat out worse than just watching on TV. Just think about it: would it be enjoyable to be teleported from sideline to baseline to baseline and back again, completely at the whim of some producer, and often in the middle of the play, such that you have to get your bearings to even figure out what is going on? It would be physically uncomfortable — and that’s exactly what it was in the Vision Pro.\nWhat is so frustrating is that the right approach is so obvious that I wrote about it the day you announced this device: one camera, with no production. Just let me sit courtside and watch an NBA game. I don’t need a scoreboard, I can look up and see it. I don’t need a pre-game or post-game show, I can simply watch the players warm-up. I don’t need announcers, I’d rather listen to the crowd and the players on the court. You have made a device that, for this specific use case, is better than TV in every way, yet you insist on producing content for it like it is TV! Just stop!\nA Ticket to Live\nThere will be more games this year; from\nyour press release last October\n:\nBasketball fans will soon be able to experience NBA games like never before in Apple Immersive on Apple Vision Pro, with a selection of live Los Angeles Lakers matchups during the 2025-26 season, courtesy of Spectrum SportsNet. Viewers will feel the intensity of each game as if they were courtside, with perspectives impossible to capture in traditional broadcasts. The schedule of games will be revealed later this fall, with the first game streaming by early next year, available through the forthcoming Spectrum SportsNet app for Vision Pro.\nThat schedule was\nannounced last week\n, and there are six games total (including last Friday’s). Six! That’s it.\nI get it, though: producing these games is expensive: you need a dedicated studio host, a dedicated broadcast crew, multiple cameras, a dedicated production crew, and that costs money. Except\nyou don’t need those things at all\n. All that you need to do, to not just create a good-enough experience but a\nsuperior\nexperience, is simply set up the cameras and let me get from the Vision Pro what I can’t get from anything else: the feeling that I am actually there.\nAnd, I would add, you shouldn’t stop with the Lakers: there should be Vision Pro cameras at every NBA game, at every NFL game, at every NHL game, at every MLB game — they should be standard issue at every stadium in the world. There should be Vision Pro cameras at every concert hall and convention center. None of these cameras need a dedicated host or announcers or production crew, because the Vision Pro isn’t TV; it’s actual presence, and presence is all you need. $3,499 is a lot of money for physically uncomfortable TV; it’s an absolute bargain if it’s a way to experience any live experience in the world on demand.\nBut, alas, you refuse. So nope, I still can’t recommend the Vision Pro, not because it’s heavy or expensive or has an external battery, but because you, Apple, have no idea what makes it special.\nShare\nClick to share on Facebook (Opens in new window)\nFacebook\nClick to share on X (Opens in new window)\nX\nClick to share on LinkedIn (Opens in new window)\nLinkedIn\nClick to email a link to a friend (Opens in new window)\nEmail",
    "canonical_url": "https://stratechery.com/2026/apple-you-still-dont-understand-the-vision-pro/",
    "word_count": 2764,
    "content_hash": "2c5792eca6c294669ce2574a8687c53c584267344e0e71506d98d514bd186d5e"
  },
  {
    "title": "Meta Compute, The Meta-OpenAI Battle, The Reality Labs Sacrifice",
    "publication_date": "2026-01-14T06:00:00-05:00",
    "cleaned_text": "Listen to this post:\nYour browser does not support the audio element.\nGood morning,\nNext Monday is the Martin Luther King Jr. federal holiday; there will be no Update.\nMeanwhile, Jon at\nAsianometry\nhas\na new video about the Tandem NonStop\n, a computer designed to never fail.\nOn to the Update:\nMeta Compute\nFrom Mark Zuckerberg on\nThreads\n:\nToday we’re establishing a new top-level initiative called Meta Compute. Meta is planning to build tens of gigawatts this decade, and hundreds of gigawatts or more over time. How we engineer, invest, and partner to build this infrastructure will become a strategic advantage. This effort will be led by Santosh Janardhan and Daniel Gross.\nSantosh will continue to lead our technical architecture, software stack, silicon program, developer productivity, and building and operating our global datacenter fleet and network. Daniel will lead a new group responsible for long-term capacity strategy, supplier partnerships, industry analysis, planning, and business modeling.\nThey will work closely with Dina Powell McCormick, who just joined Meta as President and Vice Chairman to work on partnering with governments and sovereigns to build, deploy, invest in, and finance Meta’s infrastructure. I’m looking forward to working closely with Daniel, Santosh, Dina and their teams to scale Meta Compute and deliver personal superintelligence to billions of people around the world.\nA narrative seemed to quickly spin up that this signaled that Meta is finally going to get into cloud computing, competing with Amazon, Microsoft, and Google, and, well, I really don’t think that is going to happen. What exactly would be the point? Amazon invented the space and invested heavily to have a structural cost advantage in commodity compute; Microsoft had a natural customer base with enterprise; Google has differentiated infrastructure and an outlet to fully leverage their AI investments without fear of cannibalization. What exactly would Meta bring to the table that the other hyperscalers do not have, such that they would have confidence that they could be anything other than a 2nd choice competing on nothing but price?\nThe Meta-OpenAI Battle\nOpenAI was founded by Sam Altman and Elon Musk with the express purpose of countering Google; then, when ChatGPT took the world by storm, the immediate assumption by everyone — including yours truly — is that Google was the Big Tech company most threatened. In January 2023’s\nAI and the Big Five\nI wrote:\nThat, though, ought only increase the concern for Google’s management that generative AI may, in the specific context of search, represent a disruptive innovation instead of a sustaining one. Disruptive innovation is, at least in the beginning, not as good as what already exists; that’s why it is easily dismissed by managers who can avoid thinking about the business model challenges by (correctly!) telling themselves that their current product is better. The problem, of course, is that the disruptive product gets better, even as the incumbent’s product becomes ever more bloated and hard to use — and that certainly sounds a lot like Google Search’s current trajectory.\nMeanwhile, I was already optimistic about the impact on Meta:\nWhat will be interesting to see is how things like image and text generation impact Meta in the long run:\nSam Lessin has posited\nthat\nthe end-game for algorithmic timelines\nis AI content; I’ve made the same argument\nwhen it comes to the Metaverse\n. In other words, while Meta is investing in AI to give personalized recommendations, that idea, combined with 2022’s breakthroughs, is personalized content, delivered through Meta’s channels.\nFor now it will be interesting to see how Meta’s advertising tools develop: the entire process of both generating and A/B testing copy and images can be done by AI, and no company is better than Meta at making these sort of capabilities available at scale. Keep in mind that Meta’s advertising is primarily about the top of the funnel: the goal is to catch consumers’ eyes for a product or service or app they did not know previously existed; this means that there will be a lot of misses — the vast majority of ads do not convert — but that also means there is a lot of latitude for experimentation and iteration. This seems very well suited to AI: yes, generation may have marginal costs, but those marginal costs are drastically lower than a human.\nI expanded on my Meta optimism in 2024’s\nMeta’s AI Abundance\n, but by 2025 things were looking dicey. First there was the Llama 4 fiasco, and then\nthat weird interview I did with Mark Zuckerberg\nwhere I felt like I had a clearer vision of Meta’s AI opportunity than he did; a few months later and Zuckerberg overhauled Meta’s entire AI team, bringing in talent like Gross and many others, and declaring that\nPersonal Superintelligence was the company’s new mission\n:\nMeta’s vision is to bring personal superintelligence to everyone. We believe in putting this power in people’s hands to direct it towards what they value in their own lives. This is distinct from others in the industry who believe superintelligence should be directed centrally towards automating all valuable work, and then humanity will live on a dole of its output. At Meta, we believe that people pursuing their individual aspirations is how we have always made progress expanding prosperity, science, health, and culture. This will be increasingly important in the future as well. The intersection of technology and how people live is Meta’s focus, and this will only become more important in the future…\nMeta believes strongly in building personal superintelligence that empowers everyone. We have the resources and the expertise to build the massive infrastructure required, and the capability and will to deliver new technology to billions of people across our products. I’m excited to focus Meta’s efforts towards building this future.\nThat vision is all well and good; what has been much more concerning to me is the prospect of ChatGPT actually being much more of a threat to Meta than to Google. First off, there is simply the matter of time; time is the only scarce resource on the Internet, and every minute spent in ChatGPT is a minute that is no longer available to Meta. Second, a product like Sora was\nmuch more of an assault on Meta’s core use case than Google’s\n.\nSora has, in the end, not amounted to much; it’s 77th in the App Store, even behind Meta AI at 68 (and, for the record, I still find Vibes more interesting, although I rarely use it). OpenAI\ndid make that deal with Disney\n, so they haven’t given up on Sora, but I think it’s enough to note that just because Meta dominates time spent — and may have seen off this threat — it’s not guaranteed they will dominate time spent forever. There are potential weak points.\nTo that end, the best defense is often a good offense, and OpenAI has weaknesses of its own. Specifically,\nthe accidental consumer tech company\nis, by all accounts, still starved for compute, and has announced audacious infrastructure plans. Those plans, however, have boomeranged on the company, as the primary response has been questions about how exactly OpenAI will pay for everything, particularly given the fact the company still doesn’t have a scalable advertising model.\nA scalable advertising model is exactly what Meta has, however, and the free cash flow that comes with it. The question for OpenAI is if they can not just raise money but make money; the question for Meta is what Mark Zuckerberg is willing to commit to. And, well, he’s committing to building more compute than OpenAI, and critically, has a credible way to pay for it.\nTo put it another way, I view the Meta Compute initiative as a bet that the limiting factor in AI will be infrastructure. Meta may not have state of the art models today, but the company is betting that that can be overcome, as long as you have enough compute to leverage them, which, by extension, means a business model to fund them. That’s exactly what Meta has — and remember, Zuckerberg has claimed that the company already\nsees positive ROI from more compute\n(and I believe him).\nThe Reality Labs Sacrifice\nHowever, Wall Street doesn’t necessarily believe Zuckerberg, if the reaction to last quarter’s earnings is any indication;\nI wrote at the time\nthat this lack of faith was the true cost of Reality Labs.\nWhat I also think is happening is that Meta is finally paying the price for the billions of dollars it has spent on Reality Labs with precious little financial return to show for it. Yes, investors have long grumbled at how much money Meta has spent on AR and VR, but ultimately I think Zuckerberg has gotten a pass; even the stock market freakout in 2022 was more about TikTok and ATT than about the Metaverse (the Metaverse spending was taken as an indication that Meta’s core business was faltering).\nThis time, however, Zuckerberg once again seems to be asking for a blank check, and given that the last blank check is growing, not cashing, I think that investors are hesitant about writing another one. Again, I’m not sure this is necessarily fair — Meta is clearly leveraging more compute effectively in its ad business, and AI is not the Metaverse — but unless Zuckerberg wants to become the world’s biggest ad business salesman he’s going to need to show some tangible evidence sooner or later that Meta can in fact win on product.\nGiven this, I’m not at all surprised by\nthis news from Bloomberg\n:\nMeta Platforms Inc. is beginning to cut more than 1,000 jobs from the company’s Reality Labs division, part of a plan to redirect resources from virtual reality and metaverse products toward AI wearables and phone features. Affected employees will be notified of the layoffs starting Tuesday morning, according to an internal post from Chief Technology Officer Andrew Bosworth that was reviewed by Bloomberg News. The cuts are expected to hit roughly 10% of employees within the Reality Labs group, which has about 15,000 workers, Bloomberg reported earlier this week. As part of the reduction, Meta is pivoting its metaverse efforts to focus on mobile devices, according to Bosworth’s memo. The company is also planning to cut back on its virtual reality investments to make the business “more sustainable,” Bosworth wrote.\nI wouldn’t say this is an admission of failure when it comes to the Metaverse; there will still be somewhere around 13–14,000 employees working on the initiative, albeit with much more of a focus on augmented reality and mobile, and a shift in focus away from VR and gaming.\nRather, I interpret this as an acceptance of reality and the fact that while Zuckerberg may have total control of Meta, he still does, at the end of the day, answer to shareholders. Trimming Reality Labs spending has always been a card that Meta could play to allay investor concerns; that the company announced it is doing just that on the same day that Zuckerberg announced Meta Compute is surely not a coincidence.\nThis Update will be available as a podcast later today. To receive it in your podcast player,\nvisit Stratechery\nThe Stratechery Update is intended for a single recipient, but occasional forwarding is totally fine! If you would like to order multiple subscriptions for your team with a group discount (minimum 5), please contact me directly.\nThanks for being a subscriber, and have a great day!\nShare\nClick to share on Facebook (Opens in new window)\nFacebook\nClick to share on X (Opens in new window)\nX\nClick to share on LinkedIn (Opens in new window)\nLinkedIn\nClick to email a link to a friend (Opens in new window)\nEmail",
    "canonical_url": "https://stratechery.com/2026/meta-compute-the-meta-openai-battle-the-reality-labs-sacrifice/",
    "word_count": 1964,
    "content_hash": "d2779164233a88b3ced9b4986dd816bb9a0a272920476732df3fa6337d4d2830"
  }
]